package com.kh.variableEx;
/*
 심화변수는 없음!
 
 
 매개변수 = 파라미터 = parameter
 	중간에 개입해서 변경하는 수
 	주로 메서드에서 메서드이름 옆에 만들어지는 () 안에 작성
  	
  	
  	메서드
  		public  메서드이름(
  
  지역변수
  	지역에서만 유명한 변수
  	특정 지역은 {     } 사용
  	{  } 안에서 작성한 변수는 괄호를 나가게 되면 아무도 모름
  	
  	ex ) {String 지역사람 = "오항도";
  		 }
  		 오항도는 {   } 누구나 아는 사람이지만 {   } 나가는 순간부터
  		 오항도가 누구여 ..? 라는 빨간 줄이 생길 것 
  전역변수
  	 클래스이름 밑에서부터 클래스 안에서는 어디서든 사용 가능한 전국 지역으로 유명한 변수
  	
  	 ex)
  	 	public class 자바{
  			//필드 = 전역변수
  			  {   } 안에 있는 공간에서도 사용할 수 있는
  			  전국 지역에서 유명한 변수
  		}	  
  멤버변수 = 인스턴스 변수
  	 클래스 안에 작성된 변수들을 멤버변수라고 부름
 
  
  참조변수
  	 this. this() 또한 무언가를 참조해서 생략해서 작성하기 대문에 참조변수
  	 객체 c = new 객체();
  	 객체라는 파일이 위치한 주소를 참조변수라 함
  
  
  
  
 */
public class 심화변수 {

}
