package com.kh.ForEx;
/*
 For 문 : 가장 대표적인 반복문으로 특정 조건이 참일 때만 반복하고 참에서 벗어나면 반복을 종료
 for문 안에는 초기화식, 조건식, 증감식을 사용해서 반복 횟수를 조정
 반복 횟수의 마지막이 정해져 있거나 반복하는 기준이 있을 때 사용
 
  for (초기화식 ;  조건식; 증감식){
  	//조건이 참일 때 실행되는 코드
  }
  
  
  for - each 문 : 컬렉션이나 배열을 반복해서 처음부터 끝까지 슨회할 때 사용
  반복문을 간겨랗게 작성할 수 있고, 배열안에 있는 데이터 개수의 따라 자동으로 반복
  for(자료형 변수명 : 컬렉션 or 배열){  // 컬렉션 = List Set Map
   //각 데이터마다 실행되는 코드
   //데이터가 없으면 자동으로 for문 탈출
  }
  
  
  다중 for문 : for문 안에 for문이 존재하는 것으로 무한정 만들 수 있지만 메모리 소모가 큼  
  실행할 코드는 각 자리에서 있어도 되고 없어도 됨
  for(초기식;조건식;증감식){
  		실행할 코드
  	for(초기식;조건식; 증감식){
  		실행할 코드
  	}
  	실행할 코드
  }
  
  */
public class For문 {

}
